tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "spring-io/tap"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-language-server"
brew "bat"
brew "bottom"
brew "chafa"
brew "cmake"
brew "cmctl"
brew "cocoapods"
brew "coreutils"
brew "croc"
brew "curl"
brew "d2"
brew "docker"
brew "dockutil"
brew "eslint"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "flux"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gojq"
brew "golangci-lint"
brew "google-java-format"
brew "gopls"
brew "goreleaser"
brew "gradle"
brew "grafana"
brew "helm"
brew "imagemagick"
brew "iproute2mac"
brew "jdtls"
brew "kind"
brew "kubernetes-cli"
brew "less"
brew "lf"
brew "loc"
brew "loki"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "make"
brew "mas"
brew "maven"
brew "mysql", restart_service: true
brew "neofetch"
brew "neovim"
brew "nvm"
brew "openshift-cli"
brew "plantuml"
brew "pnpm"
brew "postgresql@14", restart_service: true
brew "prettier"
brew "prometheus"
brew "promtail"
brew "pulumi"
brew "pyenv"
brew "pyright"
brew "qpdf"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "rsync"
brew "ruff-lsp"
brew "rust-analyzer"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "sniffer"
brew "sniffnet"
brew "starship"
brew "stylua"
brew "syncthing"
brew "tailscale", restart_service: true
brew "tailwindcss-language-server"
brew "taplo"
brew "terraform"
brew "terraform-ls"
brew "tflint"
brew "tldr"
brew "trash"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "watch"
brew "watchman"
brew "wget"
brew "yaml-language-server"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "azure/functions/azure-functions-core-tools@4"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "spring-io/tap/spring-boot"
cask "1password"
cask "1password-cli"
cask "altserver"
cask "blender"
cask "brave-browser"
cask "discord"
cask "firefox@developer-edition"
cask "font-sf-mono-nerd-font-ligaturized"
cask "google-chrome"
cask "iina"
cask "insomnia"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "microsoft-remote-desktop"
cask "obs"
cask "openvpn-connect"
cask "outline-manager"
cask "oversight"
cask "postman"
cask "raspberry-pi-imager"
cask "rectangle"
cask "redisinsight"
cask "screen-studio"
cask "signal"
cask "spotify"
cask "warp"
cask "wechat"
mas "ColorSlurp", id: 1287239339
mas "Dark Noise", id: 1465439395
mas "Klack", id: 6446206067
mas "Outline", id: 1356178125
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
