tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "localsend/localsend"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "spring-io/tap"
brew "age"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-language-server"
brew "bat"
brew "bitwarden-cli"
brew "bob"
brew "bottom"
brew "chafa"
brew "cmake"
brew "cmctl"
brew "cocoapods"
brew "coreutils"
brew "croc"
brew "curl"
brew "d2"
brew "deno"
brew "dockutil"
brew "eslint"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gojq"
brew "golangci-lint"
brew "gopls"
brew "goreleaser"
brew "grafana"
brew "helm"
brew "imagemagick"
brew "iproute2mac"
brew "jdtls"
brew "kind"
brew "kubernetes-cli"
brew "lazydocker"
brew "less"
brew "loc"
brew "loki"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "make"
brew "marksman"
brew "mas"
brew "mysql"
brew "neovim"
brew "nmap"
brew "nvm"
brew "openshift-cli"
brew "pnpm"
brew "portal"
brew "postgresql", restart_service: true
brew "prettier"
brew "prometheus"
brew "promtail"
brew "pulumi"
brew "pyenv"
brew "pyright"
brew "qpdf"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "rsync"
brew "ruff-lsp"
brew "rust-analyzer"
brew "rustup"
brew "shellcheck"
brew "shfmt"
brew "smartmontools"
brew "sniffer"
brew "sniffnet"
brew "speedtest-cli"
brew "sshs"
brew "starship"
brew "stylua"
brew "syncthing"
brew "tailscale", restart_service: true
brew "tailwindcss-language-server"
brew "taplo"
brew "termshark"
brew "terraform"
brew "terraform-ls"
brew "tflint"
brew "tldr"
brew "tmux"
brew "trash", link: true
brew "typescript-language-server"
brew "typst"
brew "vscode-langservers-extracted"
brew "wakeonlan"
brew "watch"
brew "watchman"
brew "wget"
brew "yaml-language-server"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "azure/functions/azure-functions-core-tools@4"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "qmk/qmk/qmk"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "altserver"
cask "baidunetdisk"
cask "bitwarden"
cask "blender"
cask "brave-browser"
cask "cursor"
cask "deluge"
cask "discord"
cask "docker"
cask "firefox@developer-edition"
cask "font-sf-mono-nerd-font-ligaturized"
cask "google-chrome"
cask "iina"
cask "input-source-pro"
cask "karabiner-elements"
cask "keycastr"
cask "kitty"
cask "localsend"
cask "loopback"
cask "microsoft-remote-desktop"
cask "moonlight"
cask "obs"
cask "outline-manager"
cask "oversight"
cask "protonvpn"
cask "proxyman"
cask "qmk-toolbox"
cask "raspberry-pi-imager"
cask "rectangle"
cask "redisinsight"
cask "screen-studio"
cask "signal"
cask "spacedrive"
cask "spotify"
cask "surge"
cask "telegram"
cask "visual-studio-code"
cask "warp"
cask "wechat"
cask "wireshark"
mas "ColorSlurp", id: 1287239339
mas "Compressor", id: 424390742
mas "Dark Noise", id: 1465439395
mas "Final Cut Pro", id: 424389933
mas "Klack", id: 6446206067
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Motion", id: 434290957
mas "Outline", id: 1356178125
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "42crunch.vscode-openapi"
vscode "adam-bender.commit-message-editor"
vscode "adpyke.codesnap"
vscode "antiantisepticeye.vscode-color-picker"
vscode "anysphere.pyright"
vscode "arjun.swagger-viewer"
vscode "artizon.artizon-theme"
vscode "artizon.artizon-vscode-surround"
vscode "bierner.comment-tagged-templates"
vscode "bierner.emojisense"
vscode "bierner.lit-html"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "ciantic.keymapceditor-vsc"
vscode "ckolkman.vscode-postgres"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "dbaeumer.vscode-eslint"
vscode "dlasagno.rasi"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "genieai.chatgpt-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "hediet.vscode-drawio"
vscode "helgardrichard.helium-icon-theme"
vscode "humao.rest-client"
vscode "jebbs.plantuml"
vscode "jnoortheen.nix-ide"
vscode "johnnymorganz.stylua"
vscode "josetr.cmake-language-support-vscode"
vscode "justusadam.language-haskell"
vscode "lokalise.i18n-ally"
vscode "mads-hartmann.bash-ide-vscode"
vscode "matangover.mypy"
vscode "mattn.lisp"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mushan.vscode-paste-image"
vscode "mxsdev.typescript-explorer"
vscode "naumovs.color-highlight"
vscode "nickmillerdev.pytest-fixtures"
vscode "nvarner.typst-lsp"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "prisma.prisma"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "simonsiefke.svg-preview"
vscode "slevesque.shader"
vscode "sonarsource.sonarlint-vscode"
vscode "sswg.swift-lang"
vscode "stkb.rewrap"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "terrastruct.d2"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "yoavbls.pretty-ts-errors"
