homebrew/cask/altserver
homebrew/cask/android-studio
homebrew/cask/blender
homebrew/cask/brave-browser
homebrew/cask/datagrip
homebrew/cask/discord
homebrew/cask/docker
homebrew/cask/google-chrome
homebrew/cask/iina
homebrew/cask/insomnia
homebrew/cask/karabiner-elements
homebrew/cask/kitty
homebrew/cask/microsoft-remote-desktop
homebrew/cask/obs
homebrew/cask/outline-manager
homebrew/cask/postman
homebrew/cask/raspberry-pi-imager
homebrew/cask/spotify
homebrew/cask/visual-studio-code
homebrew/cask/warp
homebrew/cask-fonts/homebrew/cask-fonts/font-droid-sans-mono-nerd-font
homebrew/cask-versions/homebrew/cask-versions/firefox-developer-edition
shaunsingh/sfmono-nerd-font-ligaturized/shaunsingh/sfmono-nerd-font-ligaturized/font-sf-mono-nerd-font-ligaturized
